Ran Plan for 2 projects:

1. dir: `modules/gcs` workspace: `default`
1. dir: `modules/iam` workspace: `default`
---

### 1. dir: `modules/gcs` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d modules/gcs
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Finure%252Fterraform-apps%252Fmodules%252Fgcs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d modules/gcs
  ```

---
### 2. dir: `modules/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_service_account.service-account["test:testing"] will be destroyed
  # (because key ["test:testing"] is not in for_each map)
- resource "google_service_account" "service-account" {
      - account_id   = "testing" -> null
      - disabled     = false -> null
      - display_name = "test SA" -> null
      - email        = "testing@finure-465001.iam.gserviceaccount.com" -> null
      - id           = "projects/finure-465001/serviceAccounts/testing@finure-465001.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:testing@finure-465001.iam.gserviceaccount.com" -> null
      - name         = "projects/finure-465001/serviceAccounts/testing@finure-465001.iam.gserviceaccount.com" -> null
      - project      = "finure-465001" -> null
      - unique_id    = "101195947803950682628" -> null
        # (1 unchanged attribute hidden)
    }

  # google_service_account.service-account["test:testing1"] will be created
+ resource "google_service_account" "service-account" {
      + account_id   = "testing1"
      + disabled     = false
      + display_name = "test SA"
      + email        = "testing1@finure-465001.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:testing1@finure-465001.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "finure-465001"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.workload_identity_binding["test:testing"] will be destroyed
  # (because key ["test:testing"] is not in for_each map)
- resource "google_service_account_iam_member" "workload_identity_binding" {
      - etag               = "BwY86p+/MOY=" -> null
      - id                 = "projects/finure-465001/serviceAccounts/testing@finure-465001.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:finure-465001.svc.id.goog[testing/testing]" -> null
      - member             = "serviceAccount:finure-465001.svc.id.goog[testing/testing]" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/finure-465001/serviceAccounts/testing@finure-465001.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.workload_identity_binding["test:testing1"] will be created
+ resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:finure-465001.svc.id.goog[testing/testing]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/finure-465001/serviceAccounts/testing1@finure-465001.iam.gserviceaccount.com"
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d modules/iam
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Finure%252Fterraform-apps%252Fmodules%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d modules/iam
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```